// Задача 68: Напишите программу вычисления функции Аккермана с помощью рекурсии. 
// Даны два неотрицательных числа m и n.








Console.Write("Введите первое значение: ");
int m = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите второе значение: ");
int n = Convert.ToInt32(Console.ReadLine());